package interview;

/**
 * ClassName: HR <br/>
 * Function: 回答问题的思路：总-分-总<br/>
 *
 * @author gary.liu
 * @date 2019/9/29
 */
public class HR {
/**
 1.家是哪里的，以后的工作期望地点
 2.期望的薪资是多少，现在已经有什么offer了
   double
 3.项目情况
 3.如何看待加班问题，对拼多多的11 10 6怎么看，可以接受么
    1.表明态度：可以接受，之前更凶，但会去复盘、反思加班的原因和如何提高效率
    2.导致加班原因：项目赶进度，需求范围、里程碑和职责不明确导致的重复修改和返工
    3.解决方法：和产品明确需求范围和里程碑，比如每天的答疑，开发出答疑工具给产品和运营使用
    4.总结：可以接受但会想办法解决和提高效率
 4.上一段工作经历有什么收获
    1.技术上：遇到很多牛人、为解决某一问题沉淀的好的技术，遇到一些高并发的场景的解决
    2.做事方法：每周总结，问题复盘，自主学习研究技术和业务的不足，主动去发现和解决问题的能力
    3.做人：责任心（同时有解决问题的能力），多思考
 5.平时自己是怎么学习技术的，除了Java相关，还会去了解其他什么技术
    1.带着问题去学习，解决问题的同事延伸和扩展，会把思路记录到blog中
    2.按着技术人的成长路线图去提高自己
    3.看牛人的代码、设计思路，学习方法等
 6.对拼多多有什么了解
    成立于2015年9月，用户通过发起和朋友，家人，邻居等的拼团，以更低的价格，拼团购买商品。旨在凝聚更多人的力量，用更低的价格买到更好的东西，体会更多的实惠和乐趣。
    是一家专注于C2B拼团的第三方社交电商平台。
    百科：https://baike.baidu.com/item/%E6%8B%BC%E5%A4%9A%E5%A4%9A/19143667?fr=aladdin







  */
}
